Repository: khalid-hussain/hundred-hanbali-questions
Catalog: hundred-hanbali-questions-level2.tmx
Source language: ar_sa
Languages: en_gb

source: ومثال ذلك: لو توضأتَ الساعة الواحدة ظهرًا، ومَسَحْتَ على الخفين، ثم انتقض وضوءك في الساعة السادسة فإنه يجوز لك وأنت مقيمٌ أن تمسح على الخفينِ إلى الساعة السادسة من اليوم التالي.
en_gb: For example, if you make _wuḍūʾ_ at 1pm and wiped over your _khuffs_. Then you lost your _wuḍūʾ_ at 6pm, it is allowed for you, as a resident, to wipe over your _khuffs_ until 6pm the following day.

source: ومجاوزةُ محلِّ الفرضِ في الأعضاءِ الأربعةِ.
en_gb: Exceeding the required area in the four limbs.

source: ومسح اليدين إلى الكوعين.
en_gb: Wiping the hands including the wrists.

source: ومسُّ المصحفِ بلا حائلٍ.
en_gb: Touching a _muṣḥaf_ without a barrier.

source: ومهبِّ الريح.
en_gb: Face the wind (otherwise there is a chance the urine will splash back).

source: ومَنْزِلٍ.
en_gb: (or when entering) the home

source: ونارٍ.
en_gb: (and on) fire.

source: ونتفُ الإبطِ.
en_gb: Pluck out armpit hair

source: وهذه المسألة والتي قبلها من مفردات المذهب.
en_gb: This issue along with the one before it is from the _mufradāt_ of the Madhhab.

source: وهنا: 1.
en_gb: Here: 1.

source: وهو بالماءِ: عَوْدُ خُشُونَةِ المحلِّ كما كان.
en_gb: With water: Returning the impure state of the place to the former (pure) state.

source: وهو طَاهِرٌ فِي نَفْسِهِ، مُطَهِّرٌ لِغَيْرِهِ.
en_gb: It is pure in itself and purifying for other than it.

source: وهو ما دونَ القُلَّتَيْنِ - فينجُسُ بمجردِ ملاقاة النجاسةِ له، سواء تغيَّرَ أَوْ لم يتغيَّر.
en_gb: That which is less than _qullatayn_ - It becomes _Najis_ just by coming into contact with _najāsah_, irrespective if it changes or not.

source: وهو ما فوقَ القُلَّتَيْنِ - فينجسُ إذا تغيَّر لونُهُ أو طعمُهُ أو ريحُهُ.
en_gb: That which is greater than _qullatayn_ - it becomes _Najis_ if its color, taste, or smell changes.

source: وهوَ^[أي: الماء الطاهر.] طاهرٌ في نَفْسِهِ، غَيْرُ مُطَهِّرٍ لِغَيْرِهِ.
en_gb: And it^[i.e. _Ṭāhir_ water] is pure itself but not purifying.

source: وهيَ زيادة غريبة!
en_gb: What a strange addition it is!

source: ويتأكَّدُ:
en_gb: It's emphasized during times like:

source: ويتيمم للكلّ استحبابًا للحاجةِ.[^ف6]
en_gb: Tayammum is recommended for all the aforementioned due to need.[^fn6]

source: ويجبُ مسحُ أكثرِ أَعْلاهُ، ولا يُجْزِىءُ مَسْحُ أَسْفَلِهِ ولا عَقِبَهُ، ولا يُسنُّ ذلك.
en_gb: It's obligatory to wipe the majority of the upper portion/top (of the _khuffs_), wiping the lower portion or the heel doesn't suffice, nor is it recommended.

source: ويجزىء عن التراب الصابون والأُشنان ونحوهما.
en_gb: Earth can be replaced with soap, (saltwort?), or similar.

source: ويجوزُ البولُ قَائِمًا إذَا أَمِنَ ناظرًا أَوْ تَلْوِيْثًا.
en_gb: It permissible to urinate standing if no one is looking and one is sure that the urine won't splash back.(It is permissible to urinate standing if he is secure from people's eyesight and contamination (by urine splashing)).

source: ويدخلُ سبابتيهِ في صِمَاخ أذنيه،[^ف3] ويمسحُ بإبهامَيْهِ ظاهِرَهُمَا.
en_gb: XXX And then to enter his forefingers into the meatus his ears and to wipe their outer section with his thumbs.[^fn3]

source: ويعفى في الصَّلاةِ عن يسيرِ الدّم والقيحِ منه، إِنْ كانَ طاهرًا في الحَيَاةِ.
en_gb: A small amount of blood and pus from [such an animal] is excused if it is _ṭāhir_ when living.

source: ويغسلُ كفيْهِ ثلاثًا.
en_gb: Then to wash the hands thrice.

source: ويكفي في بولِ صَبيٍّ لم يأكلِ الطَّعامَ نضحُهُ وغمرُهُ بالماءِ.
en_gb: For the urine of a baby boy who has not yet eaten food (just breastfeeding), it is sufficient to dampen the area by sprinkling water.

source: ويكفي في بولِ صَبيٍّ لم يأكلِ الطَّعامَ نضحُهُ وغمرُهُ: بالماءِ.
en_gb: For the urine of a baby boy who has not yet eaten food (just breastfeeding)

source: ويمسحُ مسافرٌ سَفَرَ قصْرٍ، ثلاثةَ أَيَّام بلياليها، ومسافة القَصْر: يومان معتدلان بسير الأثْقَالِ ودبيبِ الأقدام.[^ف2]
en_gb: A traveller who shortens the prayer wipes for (a duration of) three days and three nights. The (travel) distance for which it permissible to shorten the prayers is: A travel of two moderate (in time) days on a beast (like camels, etc.) progressing at a steady pace.[^fn-2]

source: ويَحْرُمُ عَلَيْهِ:
en_gb: It is _ḥarām_ to:

source: ويَشدُّ لَحْمَةَ الأَسْنَانِ.
en_gb: Strengthens the gums

source: وَحَرُمَ حَلْقُهَا، ولا بَأْسَ بأَخْذِ مَا زَادَ عَلىٰ القبضةِ منْها.
en_gb: It's prohibited to shave the beard, there is nothing wrong in taking from whatever exceeds a fistful.

source: وَغَسْلُ الرَّجُلَيْنِ معَ الكعبينِ، وهُمَا: العظمانِ الناتِئَانِ في أَسْفَلِ السَّاقِ.
en_gb: The washing of the feet up to the ankles, i.e. the two protruding bones at the bottom of the shins.

source: وَغَسْلُ اليدين مع المرفقينِ، وَالمِرْفَقُ: هو العظمُ الفاصِلُ بَيْنَ الذِّراع والعَضُدِ.
en_gb: The washing of the hands up to the _mirfaqayn_ (elbows); a _mirfaq_ is the joint between the forearm bones (radius and ulna) and the humerus.

source: وَمَسْحُ جميعِ ظاهرِ الرأسِ، وَمِنْهُ: الأُذُنَانِ، والبَيَاضُ الذي فوقَهُمَا.
en_gb: The wiping of most of the bare head; this includes the ears and the whiteness that is above them.

source: وَوُجود الماء.
en_gb: Presence of water.

source: يجوز المسح على الجبيرة، وهي: أخشاب أو خرق ثربط على الكسر أو الجرح.
en_gb: It is permissible to wipe over an over an orthosis, that is made of wood or bandage, placed over a fracture or wound.

source: يَجُوْزُ استعمالُهُ في غَيْرِ رَفْعِ حَدَثٍ وزوالِ خَبَثٍ كَطَبْخٍ وَشُرْبٍ وَنَحْوِهِمَا.
en_gb: It is permissible to use for other than removing physical and ritual impurity such as in cooking and drinking and their likes.

source: يَرْفَعُ الحَدَثِ وَيزيلُ الخَبَثِ.
en_gb: It can lift spiritual impurity and remove regular impurities.
